12/data/attachments/1d24ecdecdbbb1b8.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_6902f9a9-6f6a-45c1-9334-95ae76b75ccf</nif:username>
            <nif:friendToBeAdded>John_glass_Actions_55780_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>